import math


def area(r):
    '''
    Вычисляет площадь круга по заданному радиусу.

        Параметры:
            r (float): радиус круга

        Возвращаемое значение:
            float: площадь круга

        Пример использования:
            >>> area(4)
            50.26548245743669
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет длину окружности по заданному радиусу.

        Параметры:
            r (float): радиус круга

        Возвращаемое значение:
            float: длина окружности

        Пример использования:
            >>> perimeter(4)
            25.132741228718345
    '''
    return 2 * math.pi * r

