def area(a, b):
    '''
    Вычисляет площадь прямоугольника по его длине и ширине.

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            float: площадь прямоугольника

        Пример вызова:
            >>> area(4, 2)
            8
    '''
    return a * b

def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника по его длине и ширине.

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника

        Возвращаемое значение:
            float: периметр прямоугольника

        Пример вызова:
            >>> perimeter(4, 2)
            12
    '''
    return (a + b) * 2
