def area(a, b):
    """
    Вычисляет площадь прямоугольника по его длине и ширине.

    Args:
        a (float): длина прямоугольника.
        b (float): ширина прямоугольника.

    Returns:
        float: площадь прямоугольника.

    Example:
        >>> area(4, 2)
        8
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника по его длине и ширине.

    Args:
        a (float): длина прямоугольника.
        b (float): ширина прямоугольника.

    Returns:
        float: периметр прямоугольника.

    Example:
        >>> perimeter(4, 2)
        12
    """
    return (a + b) * 2