def area(a, h):
    '''
    Вычисляет площадь треугольника по его стороне и высоте.

        Параметры:
            a (float): сторона треугольника
            h (float): высота треугольника

        Возвращаемое значение:
            float: площадь треугольника

        Пример вызова:
            >>> area(4, 2)
            4
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Вычисляет периметр треугольника по его трём сторонам.

        Параметры:
            a (float): первая сторона треугольника
            b (float): вторая сторона треугольника
            c (float): третья сторона треугольника

        Возвращаемое значение:
            float: периметр треугольника

        Пример вызова:
            >>> perimeter(4, 2, 3)
            9
    '''
    return a + b + c
